SHIT_BOT_ID = 1341194997
GODNOSCOP_ID = 1030651845

PENGUIN_ID = 396043132

vars_dict = {"ZAVOD_CHECK": False,
             "dt": None,
             "zavod_text": "",
             "spam_mode": "medium",
             "username": None}

CHOICES = tuple([3, 4, 5, 6])

emojis = ["🎯", "🏀", "⚽", "🎰", "🎳"]

goblin_pasta = ["""
Третьего дня, по совету проверенных камрадов, приобрёл новый мегадевайс — Анальную пробку «*Сталин-3000*». 
Сразу же, задыхаясь от жадности, вскрыл коробку цепкими лапами и заюзал мегадевайс. 
Размер, *моё почтение*. Настоящей глыбой был Иосиф Виссарионович. 
Даже моя, привыкшая к суровым армейским будням, жопа, отказывалась принимать с первого захода. 
Совместными с Олегом Зотовым усилиями забороли проблему. Ощущения — АТАС. 
С автоматом не идёт ни в какое сравнение. Кроме того, усы приятно щекочут простату. *Проходил так весь день.* 
Решительно готов к съёмкам новой бездуховности.
Многие дети увидят тут проявления гомосексуализма. Тупым детям невдомёк, что *педерастия и патриотизм — это разные вещи.*
Девайс отличный, всем рекомендую к приобретению.
_Всё это, как водится, реклама._
""",
                """- Дим Юрич! \n
                - Клим Саныч! \n
                - Всем привет!""", 
                "Я вас категорически приветствую", 
                "Тупое говно тупого говна", 
                "Малолетние дебилы"]

goblin_urls = [r"https://www.youtube.com/watch?v=79IghS6mlac",
               r"https://www.youtube.com/watch?v=O9pcdJLK5Gs",
               r"https://www.youtube.com/watch?v=MD1eU7NNFZc",
               r"https://www.youtube.com/watch?v=s09KvBYvEts",
               r"https://www.youtube.com/watch?v=kMqqbwNkkAY",
               r"https://www.youtube.com/watch?v=OJcgMaRGLGg",
               r"https://www.youtube.com/watch?v=ia3ze-PgcNA",
               r"https://www.youtube.com/watch?v=ICy6hnxAo_Y",
               r"https://www.youtube.com/watch?v=4RrBSA1AVFY",
               r"https://www.youtube.com/watch?v=PKpaxs4fN3w",
               r"https://www.youtube.com/watch?v=mVYpG6Df72g",
               r"https://www.youtube.com/watch?v=oB9_J9JFUjo"]
