SHIT_BOT_ID = 1341194997
GODNOSCOP_ID = 1030651845

PENGUIN_ID = 396043132

vars_dict = {"ZAVOD_CHECK": False,
             "dt": None,
             "zavod_text": "",
             "spam_mode": "medium",
             "username": None}

CHOICES = tuple([3, 4, 5, 6])
JOSKO = tuple(["ЖОСКО", "жоска", "Жоскач", "жоскачина",
                "жоский тип", "жоский типок", "жоский типчик",
                "Да, это жоско", "жоско"])
josko_conditions = ["жестк", "жостк", "жоск", "жеск"]

PIZDEC = ["ПИЗДЕЦ", "ЕБОК", "пиздец.", "ебок."]
pizdec_ebok = ["пиздец", "ебок"]

emojis = ["🎯", "🏀", "⚽", "🎰", "🎳"]

zaebali = ["ну хватит плиз", "ну не надо", "заебали меня крутить!", "атпутите", "не буду отвечать лично *тебе*",
           "а ты кто такой вообще?"]
betrayal = ["вот так ты да", "вот так вот ты", "вот так вот да"]

belmondo_hi = ["бельмонд", "белмондо", "блемондо", "бельмондо", "бельмон", "профессионал"]
profi_here = ["Это я, профессионал", "Да, звал?", "Я тут!", "Бот-император на месте"] + zaebali

movie_here = ["Называется *'Профессионал'* с Бельмондо", "_Профессионал?_", "*Жоский профессионал!*",
              "Говорят, что это фильм 'Професионал'", "Ну 'Профессионал' же, ну?", "Это фильм 'Профессионал!",
              "Фильм 'Профессинал' - выбор настоящего МЧС!", "Прыфсовнал", "_Про - фе - сс - анал_ блеять",
              "Это с Бельмондо который? Слышал о таком."] + zaebali

scene_msg = ["сцену из одного фильма", "сцена из одного фильма", "сцены из одного фильма",
             "я помню фильм", "да так фильм один"]

oxxxy_list = ["oxхxy", "оксимирон", "мирон", "мирош", "репанись", "хочу реп", "оксиминог", "окси"]
oxxxy_rap = ["Не хочу, не буду", "Настроения нет",
"""
_Говно, залупа, пенис, хер, давалка, хуй, блядина \n
Головка, шлюха, жопа, член, еблан, петух… Мудила \n
Рукоблуд, ссанина, очко, блядун, вагина \n
Сука, ебланище, влагалище, пердун, дрочила \n
Пидор, пизда, туз, малафья \n
Гомик, мудила, пилотка, манда \n
Анус, вагина, путана, пидрила \n
Шалава, хуила, мошонка, елда…_ \n
""",
"""
_Мох! Стать похожим меньше на цветок, больше на \n
Мох! Японский сад промок, воду пьёт зелёный мох \n
Неприметным ковром стелется в тени цветов, репней и пестиков, шипов \n
Мы все исчезнем, но не мох…_
"""
             ]

fuck_you = ["Сам ты Бельморда!", "Пiшов нахуй, _кловун_", "Сам такой!", "А ты улитка🐌"]

snail = ["О, улиточка", "О, хулиточка", "О, морская!"]

balabama = ["чела реально зовут", "одного чела", "балабама"]
balabama_here = ["Чела реально зовут Балабама", "Я в ахуе", "Я в ахуёзах", "Кто-то вспомнил Балабаму?"
                 "Заебали со своим Балабамой", "Обама его звали",
                 "Да пошел ты, я профессионал, я не буду ваш мусорный юмор терпеть. "
                 "Еду к вам - вам пиздец. Бокс не поможет."
                 "Балабама вам не поможет"] + zaebali

goblin_pasta = ["""
Третьего дня, по совету проверенных камрадов, приобрёл новый мегадевайс — Анальную пробку «*Сталин-3000*». 
Сразу же, задыхаясь от жадности, вскрыл коробку цепкими лапами и заюзал мегадевайс. 
Размер, *моё почтение*. Настоящей глыбой был Иосиф Виссарионович. 
Даже моя, привыкшая к суровым армейским будням, жопа, отказывалась принимать с первого захода. 
Совместными с Олегом Зотовым усилиями забороли проблему. Ощущения — АТАС. 
С автоматом не идёт ни в какое сравнение. Кроме того, усы приятно щекочут простату. *Проходил так весь день.* 
Решительно готов к съёмкам новой бездуховности.
Многие дети увидят тут проявления гомосексуализма. Тупым детям невдомёк, что *педерастия и патриотизм — это разные вещи.*
Девайс отличный, всем рекомендую к приобретению.
_Всё это, как водится, реклама._
""", """- Дим Юрич! \n
- Клим Саныч! \n
- Всем привет!""", "Я вас категорически приветствую", "Тупое говно тупого говна", "Малолетние дебилы"]


goblin_urls = [r"https://www.youtube.com/watch?v=79IghS6mlac",
               r"https://www.youtube.com/watch?v=O9pcdJLK5Gs",
               r"https://www.youtube.com/watch?v=MD1eU7NNFZc",
               r"https://www.youtube.com/watch?v=s09KvBYvEts",
               r"https://www.youtube.com/watch?v=kMqqbwNkkAY",
               r"https://www.youtube.com/watch?v=OJcgMaRGLGg",
               r"https://www.youtube.com/watch?v=ia3ze-PgcNA",
               r"https://www.youtube.com/watch?v=ICy6hnxAo_Y",
               r"https://www.youtube.com/watch?v=4RrBSA1AVFY",
               r"https://www.youtube.com/watch?v=PKpaxs4fN3w",
               r"https://www.youtube.com/watch?v=mVYpG6Df72g",
               r"https://www.youtube.com/watch?v=oB9_J9JFUjo"]
